#+title: index



* publish settings
#+begin_src emacs-lisp
(setq org-publish-project-alist
      '(("demos-org"
         :base-directory "~/aux/ift1016b/"
         :base-extension "org"
         :publishing-directory "~/aux/docs/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4             ; Just the default for this project.
         :auto-preamble t)

        ("demos-static"
         :base-directory "~/aux/ift1016b/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/aux/docs/"
         :recursive t
         :publishing-function org-publish-attachment)

        ("demos" :components ("demos-org" "demos-static"))))
#+end_src

#+RESULTS:
| demos-org    | :base-directory | ~/aux/ift1016b/          | :base-extension | org  | :publishing-directory | ~/aux/docs/ | :recursive | t    | :publishing-function | org-html-publish-to-html | :headline-levels |   4 | :auto-preamble        | t           |            |   |                      |                        |
| demos-static | :base-directory | ~/aux/ift1016b/          | :base-extension | css\ | js\                   | png\        | jpg\       | gif\ | pdf\                 | mp3\                     | ogg\             | swf | :publishing-directory | ~/aux/docs/ | :recursive | t | :publishing-function | org-publish-attachment |
| demos        | :components     | (demos-org demos-static) |                 |      |                       |             |            |      |                      |                          |                  |     |                       |             |            |   |                      |                        |
